// Задача 10: Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Вариант, когда число генерируется случайным образом
// int num = new Random().Next(100, 1000);

// Вариант, когда пользователь вводит число
Console.Write("Введите трехзначное число: ");
int num = Convert.ToInt32(Console.ReadLine());

int secondDigit = num / 10 % 10;
Console.Write($"Вторая цифра числа {num}: {secondDigit}");
